// Ваша задача - отсортировать заданную строку. Каждое слово в строке будет содержать одно число.
// Это число - позиция, которую слово должно занимать в результате.

// Примечание: числа могут быть от 1 до 9. Таким образом, 1 будет первым словом (не 0).

// Если входная строка пуста, вернуть пустую строку. Слова во входной строке будут содержать только последовательные числа.

let str = 'маш5ина'

function numStr(str) {
arr = str.split('').find(function (item) {
        parseInt(item)
           
    })
    return  arrnumber.join()
}

console.log(numStr(str));