// // Ваша задача  - посчитать спрятанных на заднем дворе кошек (представленных в двухмерном формате Array)

// // Кошки хорошо прячутся, но их уши (''^^") видны. Ваша задача написать функцию (countCats), которая будет считать кошек. 
// Удачи!

// // Количество найденых кошек должны быть number. Если кошек не найдено, функция должна вернуть 0

function countCats(arr) {
    let arr1 = arr.flat().reduce(function (acc, item, index) {
        if (item == '^^') {
            acc.push(item)
        } else 0
        return acc
    }, [])
    return arr1.length
};
console.log(countCats([[0, 1, "^^"], [9, "^^", 2], ["^^", 8, 7]])); 

