// /* Тролли атакуют ваш раздел комментариев!

// Распространенный способ справиться с этой ситуацией - убрать все гласные из комментариев троллей, 
// нейтрализуя угрозу.
// Ваша задача - написать функцию, которая принимает строку и возвращает новую строку со всеми удаленными гласными.

// Например, строка «Этот сайт для лузеров ЛОЛ!» стал бы "тт сйт дл лзрв ЛЛ!"

// function deleteVowels(str) {
//'а','у','о','ы','э','я','ю','ё','и','е'
// return

//  */

let str = "Этот сайт для лузеров ЛОЛ!";

function deleteVowels(str) {    ///создаю функцию с параметром str
  let str1 = ['Э', 'о', 'а', 'я', 'у', 'е','О'];/// cоздаю массив гласных
  let vowels = str.split('').filter((item) => !str1.includes(item)//через сплит делаю из строки массив,
  //фильтрую массив через инклюдс.


  )

  return vowels.join( ' ')

}
console.log(deleteVowels(str));


