// // По заданному набору массива чисел вернуть аддитивную инверсию каждого элемента.
//  Каждый позитив становится негативом, а негатив становится позитивом.

// // invert([-1,-2,-4,-5]) == [1,2,4,5]
// // invert([1,2,4,5]) == [-1,-2,-4,-5]
// // invert([1,-2,4,-5]) == [-1,2,-4,5]

// // Вы можете предположить, что все значения являются целыми числами. Не изменяйте входной массив / список.



function invert(arr) {
    arr1 = arr.map(function (item) {
        if (item < 0) {
            return Math.abs(item)
        } else {
            return item * (-1)
        }
    })
    return arr1
};
console.log(invert([1, 2, 3, 4, -5])); // [-1, -2, -3, -4, 5]
